{"class_name": "Model", "keras_version": "2.0.6", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"trainable": true, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"trainable": true, "filters": 32, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"trainable": true, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"trainable": true, "filters": 64, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "kernel_size": [3, 3], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"padding": "same", "name": "average_pooling2d_1", "strides": [1, 1], "data_format": "channels_last", "trainable": true, "pool_size": [4, 4]}}, {"class_name": "Flatten", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"units": 2, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_1", "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_2", "config": {"units": 21, "trainable": true, "bias_constraint": null, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "distribution": "normal", "mode": "fan_in", "seed": null}}, "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "name": "dense_2", "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null}}], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}