{"config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 16}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 128}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 128}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 128}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_3", 0, 0, {}], ["conv2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 128}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 128}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 256}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 256}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_9", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 256}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_8", 0, 0, {}], ["conv2d_9", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_10", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 256}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_11", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 256}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["conv2d_11", 0, 0, {}], ["add_3", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_9", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_12", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 512}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_10", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_13", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 512}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_14", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [2, 2], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 512}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["conv2d_13", 0, 0, {}], ["conv2d_14", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_11", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_15", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 512}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_12", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"activation": "linear", "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_16", "data_format": "channels_last", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "dilation_rate": [1, 1], "padding": "same", "bias_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true, "filters": 512}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["conv2d_16", 0, 0, {}], ["add_5", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_13", "epsilon": 0.001, "gamma_regularizer": null, "gamma_constraint": null, "momentum": 0.99, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "trainable": true, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"pool_size": [8, 8], "padding": "same", "strides": [1, 1], "name": "average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "flatten_1", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "units": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_regularizer": null, "activity_regularizer": null, "units": 101, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "kernel_regularizer": {"config": {"l2": 0.0005000000237487257, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": false, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "scale": 2.0, "mode": "fan_in", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}], "output_layers": [["dense_1", 0, 0], ["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.6", "backend": "theano", "class_name": "Model"}